//col과 row비교해서 둘중에서 큰 값을 안에 값으로 넣기

function solution(n, left, right) {
  const result = [];
  for (let k = left; k <= right; k++) {
    const row = Math.floor(k / n) + 1;
    const col = (k % n) + 1;
    result.push(Math.max(row, col));
  }
  return result;
}

//col과 row는 0부터 시작하는 인덱스라 +1

// 정확성  테스트
// 테스트 1 〉	통과 (2.76ms, 57.7MB)
// 테스트 2 〉	통과 (2.63ms, 60.9MB)
// 테스트 3 〉	통과 (2.71ms, 61.6MB)
// 테스트 4 〉	통과 (0.08ms, 43.5MB)
// 테스트 5 〉	통과 (0.09ms, 42.8MB)
// 테스트 6 〉	통과 (2.77ms, 55.2MB)
// 테스트 7 〉	통과 (3.54ms, 58.3MB)
// 테스트 8 〉	통과 (3.09ms, 58MB)
// 테스트 9 〉	통과 (2.73ms, 58.1MB)
// 테스트 10 〉	통과 (2.52ms, 60.4MB)
// 테스트 11 〉	통과 (2.69ms, 57.1MB)
// 테스트 12 〉	통과 (2.90ms, 60.5MB)
// 테스트 13 〉	통과 (3.13ms, 60.1MB)
// 테스트 14 〉	통과 (3.17ms, 56.7MB)
// 테스트 15 〉	통과 (3.10ms, 60.7MB)
// 테스트 16 〉	통과 (3.25ms, 61MB)
// 테스트 17 〉	통과 (3.13ms, 57.9MB)
// 테스트 18 〉	통과 (3.27ms, 61.2MB)
// 테스트 19 〉	통과 (3.18ms, 61.7MB)
// 테스트 20 〉	통과 (3.20ms, 58.8MB)
// 채점 결과
// 정확성: 100.0
// 합계: 100.0 / 100.0
