//첫 시도중 -> 로직 실패. nCr로 조합 로직으로 수학적으로 접근하려했지만, 조합방식은 오버플로우가 발생하는 문제가 있어서 코딩테스트에서 부적합한 방식임
// function solution(n) {
//     let result = 0;
//     let Allone = n;
//     let Alltwo = 0;
//     if (Allone % 2 === 0){
//         Alltwo = n / 2;
//     }
//     else {
//         Alltwo = (n - 1) / 2;
//     }
//     for (let i = Alltwo; i <= Allone; i++){
//         result += (i - Alltwo) * ()
//     }
// }

//피보나치 수열

function solution(n) {
  // dp[i] = i번째 칸까지 도달하는 방법의 수
  const dp = new Array(n + 1).fill(0);

  dp[1] = 1;
  dp[2] = 2;

  for (let i = 3; i <= n; i++) {
    dp[i] = (dp[i - 1] + dp[i - 2]) % 1234567;
  }

  return dp[n];
}
//주의사항 더할 때마다 %1234567을 적용해야 안전범위내에 숫자가 있음

// 정확성  테스트
// 테스트 1 〉	통과 (0.07ms, 43.8MB)
// 테스트 2 〉	통과 (0.08ms, 43.7MB)
// 테스트 3 〉	통과 (0.10ms, 43.6MB)
// 테스트 4 〉	통과 (0.09ms, 43.5MB)
// 테스트 5 〉	통과 (0.09ms, 43.7MB)
// 테스트 6 〉	통과 (0.07ms, 43.6MB)
// 테스트 7 〉	통과 (0.09ms, 43.7MB)
// 테스트 8 〉	통과 (0.08ms, 43.7MB)
// 테스트 9 〉	통과 (0.08ms, 43.6MB)
// 테스트 10 〉	통과 (0.08ms, 43.7MB)
// 테스트 11 〉	통과 (0.15ms, 43.7MB)
// 테스트 12 〉	통과 (0.17ms, 43.5MB)
// 테스트 13 〉	통과 (0.14ms, 43.9MB)
// 테스트 14 〉	통과 (0.16ms, 43.6MB)
// 테스트 15 〉	통과 (0.16ms, 43.8MB)
// 테스트 16 〉	통과 (0.19ms, 43.8MB)
// 채점 결과
// 정확성: 100.0
// 합계: 100.0 / 100.0
