//각 행은 [의상 이름, 의상 종류]

function solution(clothes) {
  const counts = {}; //객체

  for (let i = 0; i < clothes.length; i++) {
    const [name, type] = clothes[i];
    counts[type] = (counts[type] || 0) + 1;
  }
  return Object.values(counts).reduce((acc, cur) => acc * (cur + 1), 1) - 1;
}

//객체 값들만 배열로 꺼내는 방법
//Object.values({headgear: 2, eyewear: 1})  // [2, 1];

//경우의 수 총개수
//headgear는 2개 + 안쓰는경우 1가지 포함해서 3가지 경우.
//eyewear는 1개 + 안쓰는경우 1가지 포함해서 2가지 경우.
// 3 * 2 = 6에서 아무것도 안입는 경우 1가지 빼기(최소 1개 착용 조건)
//6 - 1 = 총 5가지의 경우의 수

// 정확성  테스트
// 테스트 1 〉	통과 (0.14ms, 43.6MB)
// 테스트 2 〉	통과 (0.13ms, 43.9MB)
// 테스트 3 〉	통과 (0.15ms, 43.4MB)
// 테스트 4 〉	통과 (0.14ms, 43.6MB)
// 테스트 5 〉	통과 (0.12ms, 43.5MB)
// 테스트 6 〉	통과 (0.11ms, 43.6MB)
// 테스트 7 〉	통과 (0.17ms, 43.7MB)
// 테스트 8 〉	통과 (0.15ms, 43.6MB)
// 테스트 9 〉	통과 (0.09ms, 43.8MB)
// 테스트 10 〉	통과 (0.09ms, 43.5MB)
// 테스트 11 〉	통과 (0.10ms, 43.4MB)
// 테스트 12 〉	통과 (0.16ms, 43.7MB)
// 테스트 13 〉	통과 (0.16ms, 43.6MB)
// 테스트 14 〉	통과 (0.12ms, 43.9MB)
// 테스트 15 〉	통과 (0.10ms, 43.9MB)
// 테스트 16 〉	통과 (0.12ms, 43.8MB)
// 테스트 17 〉	통과 (0.14ms, 43.5MB)
// 테스트 18 〉	통과 (0.16ms, 43.5MB)
// 테스트 19 〉	통과 (0.15ms, 43.5MB)
// 테스트 20 〉	통과 (0.13ms, 43.5MB)
// 테스트 21 〉	통과 (0.12ms, 43.7MB)
// 테스트 22 〉	통과 (0.13ms, 43.9MB)
// 테스트 23 〉	통과 (0.13ms, 43.6MB)
// 테스트 24 〉	통과 (0.14ms, 43.8MB)
// 테스트 25 〉	통과 (0.13ms, 43.5MB)
// 테스트 26 〉	통과 (0.17ms, 43.5MB)
// 테스트 27 〉	통과 (0.11ms, 43.4MB)
// 테스트 28 〉	통과 (0.14ms, 43.6MB)
// 채점 결과
// 정확성: 100.0
// 합계: 100.0 / 100.0
