// 신규 아이디 추천

function solution(new_id) {
  //1단계
  let id = new_id.toLowerCase();

  //2단계: 이 []안에 있는 문자말고 ^(나머지)를 제거해달라
  id = id.replace(/[^a-z0-9-_.]/g, "");

  //3단계: 마침표 2개이상은 1개로 바꾸기
  id = id.replace(/\.{2,}/g, ".");
  // /   \.   {2,}   /g
  // │   │     │      └─ g (Global): 문자열 전체에서 모든 일치 항목을 다 찾음
  // │   │     └─ {2,}: 바로 앞의 문자가 "2개 이상 연속"으로 등장 ex.{2,5}는 2번이상 5번이하
  // │   └─ \. : 특수기호가 아닌 진짜 "마침표(.)" 문자
  // └─ 정규표현식의 시작과 끝을 나타내는 기호

  //4단계: 처음이나 끝에 마침표 제거
  id = id.replace(/^\.|\.$/g, "");
  // ^\.   |   \.$  /g
  // │     │    │
  // │     │    └─ 끝($)에 있는 마침표(\.)
  // │     └─ 또는 (OR)
  // └─ 시작(^)에 있는 마침표(\.)

  //5단계: 빈문자열 a대입
  id = id === "" ? "a" : id;
  //더 간결한 버전
  // id = id || "a";   //JS에서 빈문자열은 falsy(거짓같은 값)으로 인정되니까, OR연산자사용하면 빈문자열이면 뒤에 a가됨

  //6단계: 길이제한 + 맨끝마침표시 제거
  if (id.length >= 16) {
    id = id.slice(0, 15).replace(/\.$/, "");
  }

  //7단계: 길이최소조건맞추기
  while (id.length < 3) {
    id += id[id.length - 1];
  }
  return id;
}
