//spoiler_ranges에 있는것만 for문 돌리고
//그 문자열이 포함되어있는 단어 출력하고,
//그단어를 배열에 이미 있는거면 무시
//배열에 없는거였으면 배열에 넣기
//그리고 마지막에 배열.length 출력
//모든 단어 위치 미리정해놓기
//인덱스마다 거꾸로 찾아가기보다 문장전체 순회해서 [텍스트, 시작인덱스, 끝인덱스]를 미리 정리해두는게 좋음
//정규식 matchAll(/\S+/g) 활용
///   \S   +   /g
//│    │   │    └─ g (Global 플래그): 첫 번째만 찾고 멈추지 말고 문자열 끝까지 전부 탐색
//│    │   └─ + (수량자): 앞의 문자가 1개 이상 연속으로 이어짐
//│    └─ \S (대문자 S): 공백(스페이스, 탭, 줄바꿈)이 '아닌' 모든 문자
//└─ 정규표현식의 시작과 끝을 감싸는 슬래시 기호
function solution(message, spoiler_ranges) {
  //1. 모든 단어의 [텍스트, 시작인덱스, 끝인덱스] 추출
  const words = [];
  for (const match of message.matchAll(/\S+/g)) {
    const text = match[0];
    const start = match.index;
    const end = start + text.length - 1;

    words.push({ text, start, end });
  }

  const blacklisted = new Set(); //중복없는 스포 중요 단어

  //2. 각 단어가 어떤 스포 구간들과 겹치는 체크
  for (const w of words) {
    w.spoilers = []; //이 단어가 포함된 spoiler_ranges의 인덱스 목록
    for (let i = 0; i < spoiler_ranges.length; i++) {
      const [sStart, sEnd] = spoiler_ranges[i];
      //구간이 겹치는지 확인하기
      if (w.start <= sEnd && w.end >= sStart) {
        w.spoilers.push(i);
      }
    }

    //스포 방지 구간이 아닌 곳에 온전히 등장한 단어는 블랙리스트 등록
    if (w.spoilers.length === 0) {
      blacklisted.add(w.text);
    }

    //완전히 공개되기까지 남은 스포 구간 수
    w.remaining = w.spoilers.length;
  }
  let importantCount = 0;
  const revealedWords = new Set(); //이미 공개된적있는 스포 단어들

  //3. spoiler_ranges를 순서대로 클릭
  for (let i = 0; i < spoiler_ranges.length; i++) {
    //이번 스포 구간(i)에 걸쳐 있는 단어들 찾기
    for (const w of words) {
      if (w.spoilers.includes(i)) {
        w.remaining--;

        //이번 클릭으로 모든 단어의 문자가 완전히 공개된 경우
        if (w.remaining === 0) {
          //조건1. 일반 단어로 등장한 적이 없어야 함
          //조건2. 이전에 이미지 공개된 단어가 아니어야 함
          if (!blacklisted.has(w.text) && !revealedWords.has(w.text)) {
            importantCount++;
          }

          //탈락 여부와 상관없이 이 스포 단어는 공개 처리
          revealedWords.add(w.text);
        }
      }
    }
  }
  return importantCount;
}

// 정확성  테스트
// 테스트 1 〉	통과 (0.22ms, 43.7MB)
// 테스트 2 〉	통과 (0.20ms, 43.6MB)
// 테스트 3 〉	통과 (0.20ms, 43.6MB)
// 테스트 4 〉	통과 (0.24ms, 43.7MB)
// 테스트 5 〉	통과 (0.32ms, 44MB)
// 테스트 6 〉	통과 (0.34ms, 43.6MB)
// 테스트 7 〉	통과 (0.28ms, 43.5MB)
// 테스트 8 〉	통과 (0.29ms, 43.7MB)
// 테스트 9 〉	통과 (0.30ms, 43.8MB)
// 테스트 10 〉	통과 (0.28ms, 43.9MB)
// 테스트 11 〉	통과 (0.27ms, 43.9MB)
// 테스트 12 〉	통과 (0.27ms, 44.1MB)
// 테스트 13 〉	통과 (0.26ms, 43.6MB)
// 테스트 14 〉	통과 (1.13ms, 45.2MB)
// 테스트 15 〉	통과 (1.27ms, 44.9MB)
// 테스트 16 〉	통과 (0.27ms, 43.6MB)
// 테스트 17 〉	통과 (0.69ms, 43.9MB)
// 테스트 18 〉	통과 (0.66ms, 43.8MB)
// 테스트 19 〉	통과 (0.30ms, 43.8MB)
// 테스트 20 〉	통과 (0.23ms, 43.7MB)
// 테스트 21 〉	통과 (0.27ms, 43.8MB)
// 테스트 22 〉	통과 (0.20ms, 43.7MB)
// 테스트 23 〉	통과 (0.24ms, 43.7MB)
// 테스트 24 〉	통과 (9.41ms, 51.6MB)
// 테스트 25 〉	통과 (4.46ms, 46MB)
// 테스트 26 〉	통과 (14.40ms, 52.5MB)
// 테스트 27 〉	통과 (19.20ms, 52.2MB)
// 테스트 28 〉	통과 (10.97ms, 51.9MB)
// 테스트 29 〉	통과 (17.47ms, 51.9MB)
// 테스트 30 〉	통과 (4.16ms, 51.6MB)
// 테스트 31 〉	통과 (5.84ms, 51.8MB)
// 테스트 32 〉	통과 (9.04ms, 51.6MB)
// 테스트 33 〉	통과 (16.99ms, 52.3MB)
// 테스트 34 〉	통과 (4.14ms, 51.4MB)
// 테스트 35 〉	통과 (8.05ms, 52MB)
// 테스트 36 〉	통과 (9.17ms, 51.5MB)
// 테스트 37 〉	통과 (1.04ms, 45.2MB)
// 테스트 38 〉	통과 (1.70ms, 45.6MB)
// 테스트 39 〉	통과 (0.28ms, 43.8MB)
// 테스트 40 〉	통과 (0.73ms, 44.1MB)
// 테스트 41 〉	통과 (1.19ms, 45.4MB)
// 테스트 42 〉	통과 (0.38ms, 43.9MB)
// 테스트 43 〉	통과 (1.20ms, 45.1MB)
// 테스트 44 〉	통과 (0.44ms, 43.9MB)
// 테스트 45 〉	통과 (1.94ms, 45.4MB)
// 테스트 46 〉	통과 (9.16ms, 51.6MB)
// 테스트 47 〉	통과 (2.76ms, 52.3MB)
// 테스트 48 〉	통과 (8.36ms, 51.8MB)
// 테스트 49 〉	통과 (8.44ms, 52.2MB)
// 테스트 50 〉	통과 (0.94ms, 45.2MB)
// 테스트 51 〉	통과 (2.98ms, 51.8MB)
// 테스트 52 〉	통과 (2.71ms, 45.9MB)
// 테스트 53 〉	통과 (0.78ms, 44.1MB)
// 테스트 54 〉	통과 (0.31ms, 43.7MB)
// 테스트 55 〉	통과 (0.34ms, 43.8MB)
// 테스트 56 〉	통과 (0.33ms, 44MB)
// 테스트 57 〉	통과 (0.26ms, 43.8MB)
// 테스트 58 〉	통과 (0.28ms, 44MB)
// 테스트 59 〉	통과 (0.26ms, 44.1MB)
// 테스트 60 〉	통과 (0.20ms, 43.9MB)
// 테스트 61 〉	통과 (0.21ms, 43.7MB)
// 테스트 62 〉	통과 (0.27ms, 43.3MB)
// 테스트 63 〉	통과 (0.26ms, 43.6MB)
// 테스트 64 〉	통과 (0.33ms, 43.7MB)
// 테스트 65 〉	통과 (0.25ms, 43.8MB)
// 테스트 66 〉	통과 (0.27ms, 44MB)
// 테스트 67 〉	통과 (0.29ms, 43.6MB)
// 테스트 68 〉	통과 (0.32ms, 43.6MB)
// 테스트 69 〉	통과 (0.33ms, 43.8MB)
// 테스트 70 〉	통과 (0.29ms, 43.8MB)
// 테스트 71 〉	통과 (0.25ms, 43.9MB)
// 테스트 72 〉	통과 (0.19ms, 44MB)
// 테스트 73 〉	통과 (0.25ms, 44MB)
// 테스트 74 〉	통과 (0.22ms, 43.7MB)
// 테스트 75 〉	통과 (0.19ms, 43.7MB)
// 테스트 76 〉	통과 (0.19ms, 43.6MB)
// 테스트 77 〉	통과 (0.22ms, 43.7MB)
// 채점 결과
// 정확성: 100.0
// 합계: 100.0 / 100.0
